Reports/ОтчетПоЗаявкамНаЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ОтчетПоЗаявкамНаЗвонок</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТелефонныхЗвонков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьВызова</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьРазговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРазговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеренаправленияЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренаправленС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренаправленНа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_Группы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID_Перенапраление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UCID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UCID_Перенапраление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CALLID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВнутреннийВызов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаИнициатор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзAvaya_CMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСессииТелефонии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСеансаТелефонии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CallId_Avaya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>First_CallId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Primary_CallId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID_Звонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВызывающийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВызываемыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеЗапросовЗвонкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеЗапросовЗвонкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСвязи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Звонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыЗапроса</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.РасшифровкаИсточниковПриходаКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.Конкуренты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Мотивации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФакторыВыбораОН</v8:Type>
						<v8:Type>cfg:EnumRef.Расположение</v8:Type>
						<v8:Type>cfg:CatalogRef.СрокиСдачиОбъектовСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныСтатусовЗапроса</v8:Type>
						<v8:Type>cfg:EnumRef.СтадииЗапроса</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравообладателя</v8:Type>
						<v8:Type>cfg:EnumRef.ЦельПокупки</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:CatalogRef.КорпусаОбъектовСтроительства</v8:Type>
						<v8:Type>cfg:EnumRef.ВозрастнаяГруппа</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПриходаКлиента</v8:Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапроса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыЗапроса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПараметра</Name>
					<Comment>Используется для параметров из табличных частей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОтчетПоЗаявкамНаЗвонок/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьТекстЗапроса(Вариант)
	
	Если ВариантОтчета = "СоЗвонкамиГрупировка" Или ВариантОтчета = "СоЗвонкамиБезГруппировки" Тогда //по звонкам
		Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ЗаявкаНаЗвонок.Ссылка КАК Ссылка
		        |ПОМЕСТИТЬ ВТ_ПервичныеДанные
		        |ИЗ
		        |	Документ.ЗаявкаНаЗвонок КАК ЗаявкаНаЗвонок
		        |ГДЕ
		        |	НЕ ЗаявкаНаЗвонок.ЭтоТестоваяЗаявка
		        |	И НЕ ЗаявкаНаЗвонок.ПометкаУдаления
		        |	И ВЫБОР
		        |			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ИСТИНА
		        |			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ЗаявкаНаЗвонок.Дата <= &ПериодОкончание
		        |			КОГДА &ПериодНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ЗаявкаНаЗвонок.Дата >= &ПериодНачало
		        |			ИНАЧЕ ЗаявкаНаЗвонок.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		        |		КОНЕЦ
		        |
		        |ИНДЕКСИРОВАТЬ ПО
		        |	Ссылка
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ИсторияЗвонков.ЗаявкаИнициатор КАК ЗаявкаИнициатор,
		        |	ИсторияЗвонков.ДлительностьВызова КАК ДлительностьВызова,
		        |	ИсторияЗвонков.ДлительностьРазговора КАК ДлительностьРазговора,
		        |	ИсторияЗвонков.ТипЗвонка КАК ТипЗвонка,
		        |	ИсторияЗвонков.ВидЗвонка КАК ВидЗвонка,
		        |	ИсторияЗвонков.Ответственный КАК Ответственный,
		        |	ИсторияЗвонков.НомерТелефона КАК НомерТелефона,
		        |	ИсторияЗвонков.Контакт КАК Контакт,
		        |	ИсторияЗвонков.ДатаНачалаЗвонка КАК ДатаНачалаЗвонка,
		        |	СоответствиеЗапросовЗвонкам.Запрос КАК Запрос
		        |ПОМЕСТИТЬ ВТ_История
		        |ИЗ
		        |	РегистрСведений.ИсторияЗвонков КАК ИсторияЗвонков
		        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеЗапросовЗвонкам КАК СоответствиеЗапросовЗвонкам
		        |		ПО ИсторияЗвонков.ID_Звонка = СоответствиеЗапросовЗвонкам.ID_Звонка
		        |ГДЕ
		        |	ИсторияЗвонков.ЗаявкаИнициатор В
		        |			(ВЫБРАТЬ
		        |				ВТ_ПервичныеДанные.Ссылка КАК Ссылка
		        |			ИЗ
		        |				ВТ_ПервичныеДанные КАК ВТ_ПервичныеДанные)
		        |
		        |ИНДЕКСИРОВАТЬ ПО
		        |	ЗаявкаИнициатор
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ПараметрыЗапроса.Регистратор КАК Регистратор,
		        |	ПараметрыЗапроса.ЗначениеСсылка КАК Стадия
		        |ПОМЕСТИТЬ ВТ_ЗапросСтадия
		        |ИЗ
		        |	РегистрСведений.ПараметрыЗапроса КАК ПараметрыЗапроса
		        |ГДЕ
		        |	ПараметрыЗапроса.Регистратор В
		        |			(ВЫБРАТЬ
		        |				ВТ_История.Запрос КАК Запрос
		        |			ИЗ
		        |				ВТ_История КАК ВТ_История)
		        |	И ПараметрыЗапроса.Параметр В
		        |			(ВЫБРАТЬ
		        |				ПараметрыЗапроса.Ссылка КАК Ссылка
		        |			ИЗ
		        |				Справочник.ПараметрыЗапроса КАК ПараметрыЗапроса
		        |			ГДЕ
		        |				ПараметрыЗапроса.Наименование = ""Стадия"")
		        |
		        |ИНДЕКСИРОВАТЬ ПО
		        |	Регистратор
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ПараметрыЗапроса.Регистратор КАК Регистратор,
		        |	ПараметрыЗапроса.ЗначениеСсылка КАК Статус
		        |ПОМЕСТИТЬ ВТ_ЗапросСтатус
		        |ИЗ
		        |	РегистрСведений.ПараметрыЗапроса КАК ПараметрыЗапроса
		        |ГДЕ
		        |	ПараметрыЗапроса.Регистратор В
		        |			(ВЫБРАТЬ
		        |				ВТ_История.Запрос КАК Запрос
		        |			ИЗ
		        |				ВТ_История КАК ВТ_История)
		        |	И ПараметрыЗапроса.Параметр В
		        |			(ВЫБРАТЬ
		        |				ПараметрыЗапроса.Ссылка КАК Ссылка
		        |			ИЗ
		        |				Справочник.ПараметрыЗапроса КАК ПараметрыЗапроса
		        |			ГДЕ
		        |				ПараметрыЗапроса.Наименование = ""Статус"")
		        |
		        |ИНДЕКСИРОВАТЬ ПО
		        |	Регистратор
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_ПервичныеДанные.Ссылка КАК Ссылка,
		        |	ВТ_История.ДлительностьВызова КАК ДлительностьВызова,
		        |	ВТ_История.ДлительностьРазговора КАК ДлительностьРазговора,
		        |	ВТ_История.ТипЗвонка КАК ТипЗвонка,
		        |	ВТ_История.ВидЗвонка КАК ВидЗвонка,
		        |	ВТ_История.Ответственный КАК Ответственный1,
		        |	ВТ_История.НомерТелефона КАК НомерТелефона,
		        |	ВТ_История.Контакт КАК Контакт,
		        |	ВТ_ЗапросСтадия.Стадия КАК Стадия,
		        |	ВТ_ЗапросСтатус.Статус КАК Статус,
		        |	ВТ_История.ДатаНачалаЗвонка КАК ДатаНачалаЗвонка,
		        |	ВТ_История.Запрос КАК Запрос
		        |ИЗ
		        |	ВТ_ПервичныеДанные КАК ВТ_ПервичныеДанные
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_История КАК ВТ_История
		        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапросСтатус КАК ВТ_ЗапросСтатус
		        |			ПО ВТ_История.Запрос = ВТ_ЗапросСтатус.Регистратор
		        |		ПО ВТ_ПервичныеДанные.Ссылка = ВТ_История.ЗаявкаИнициатор
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапросСтадия КАК ВТ_ЗапросСтадия
		        |		ПО ВТ_История.Запрос = ВТ_ЗапросСтадия.Регистратор
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Ссылка,
		        |	ДатаНачалаЗвонка,
		        |	ДлительностьВызова
		        |ИТОГИ ПО
		        |	Ссылка";
	Иначе
		Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ЗаявкаНаЗвонок.Ссылка КАК Ссылка
		        |ИЗ
		        |	Документ.ЗаявкаНаЗвонок КАК ЗаявкаНаЗвонок
		        |ГДЕ
		        |	НЕ ЗаявкаНаЗвонок.ЭтоТестоваяЗаявка
		        |	И НЕ ЗаявкаНаЗвонок.ПометкаУдаления
		        |	И ВЫБОР
		        |			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ИСТИНА
		        |			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ЗаявкаНаЗвонок.Дата <= &ПериодОкончание
		        |			КОГДА &ПериодНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		        |				ТОГДА ЗаявкаНаЗвонок.Дата >= &ПериодНачало
		        |			ИНАЧЕ ЗаявкаНаЗвонок.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		        |		КОНЕЦ"; 
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере(ТД, ПериодОтчета)
	
	ТД.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Если ВариантОтчета = "СоЗвонкамиГрупировка" Тогда
		Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	ИначеЕсли ВариантОтчета = "СоЗвонкамиБезГруппировки" Тогда
		Макет = ОтчетОбъект.ПолучитьМакет("Макет2");
	Иначе
		Макет = ОтчетОбъект.ПолучитьМакет("Макет1");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкаНаЗвонок.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПервичныеДанные
		|ИЗ
		|	Документ.ЗаявкаНаЗвонок КАК ЗаявкаНаЗвонок
		|ГДЕ
		|	НЕ ЗаявкаНаЗвонок.ЭтоТестоваяЗаявка
		|	И НЕ ЗаявкаНаЗвонок.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ИСТИНА
		|			КОГДА &ПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И &ПериодОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ЗаявкаНаЗвонок.Дата <= &ПериодОкончание
		|			КОГДА &ПериодНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					И &ПериодОкончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ЗаявкаНаЗвонок.Дата >= &ПериодНачало
		|			ИНАЧЕ ЗаявкаНаЗвонок.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияЗвонков.ЗаявкаИнициатор КАК ЗаявкаИнициатор,
		|	МИНИМУМ(ИсторияЗвонков.ДатаНачалаЗвонка) КАК ДатаПервогоЗвонка
		|ИЗ
		|	РегистрСведений.ИсторияЗвонков КАК ИсторияЗвонков
		|ГДЕ
		|	ИсторияЗвонков.ЗаявкаИнициатор В
		|			(ВЫБРАТЬ
		|				ВТ_ПервичныеДанные.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ПервичныеДанные КАК ВТ_ПервичныеДанные)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияЗвонков.ЗаявкаИнициатор";
	
	Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(ПериодОтчета.ДатаНачала));
	Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(ПериодОтчета.ДатаОкончания));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ИсторияЗвонков = Неопределено;
	Иначе
		ИсторияЗвонков = Результат.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ВариантОтчета);
	
	Запрос.Параметры.Вставить("Период", КонецДня(ПериодОтчета.ДатаОкончания) + 1);
	Запрос.Параметры.Вставить("ПериодНачало", НачалоДня(ПериодОтчета.ДатаНачала));
	Запрос.Параметры.Вставить("ПериодОкончание", КонецДня(ПериодОтчета.ДатаОкончания));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ВывестиПустойОтчет(Макет, ТД, ПериодОтчета);
	Иначе
		ТД.АвтоМасштаб = Истина;
		ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТД.ОтображатьГруппировки = Истина;
		
		ВывестиПустойОтчет(Макет, ТД, ПериодОтчета);
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,);
		
		Пока Выборка.Следующий() Цикл
			
			Если ВариантОтчета = "СоЗвонкамиБезГруппировки" Тогда
				
				СписокСтрок = Новый Массив;
				Если ИсторияЗвонков <> Неопределено Тогда
					СписокСтрок = ИсторияЗвонков.НайтиСтроки(Новый Структура("ЗаявкаИнициатор", Выборка.Ссылка));
				КонецЕсли;
				
				ВыборкаРасшифровка = Выборка.Выбрать();
				Если ВыборкаРасшифровка.Количество() > 0 Тогда
					Пока ВыборкаРасшифровка.Следующий() Цикл
						Область = Макет.ПолучитьОбласть("СтрокаОсновнойТаблицы");
						ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка.Ссылка);
						ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаРасшифровка); //"ДатаНачалаЗвонка, ДлительностьВызова, ДлительностьРазговора, ТипЗвонка, ВидЗвонка, Ответственный, НомерТелефона, Клиент, Запрос, Стадия, Статус"
						
						Если СписокСтрок.Количество() > 0 Тогда
							Область.Параметры.ДатаПервогоЗвонка = СписокСтрок[0].ДатаПервогоЗвонка;
						КонецЕсли;
						ТД.Вывести(Область);
					КонецЦикла;
				Иначе
					Область = Макет.ПолучитьОбласть("СтрокаОсновнойТаблицы");
					ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка.Ссылка);
					Если СписокСтрок.Количество() > 0 Тогда
						Область.Параметры.ДатаПервогоЗвонка = СписокСтрок[0].ДатаПервогоЗвонка;
					КонецЕсли;
					ТД.Вывести(Область);
				КонецЕсли;
			Иначе
				Область = Макет.ПолучитьОбласть("СтрокаОсновнойТаблицы");
				ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка.Ссылка);
			
				Если ИсторияЗвонков <> Неопределено Тогда
					
					СписокСтрок = ИсторияЗвонков.НайтиСтроки(Новый Структура("ЗаявкаИнициатор", Выборка.Ссылка));
					
					Если СписокСтрок.Количество() > 0 Тогда
						Область.Параметры.ДатаПервогоЗвонка = СписокСтрок[0].ДатаПервогоЗвонка;
					КонецЕсли;
				КонецЕсли;
				
				ТД.Вывести(Область);
				
				ВыборкаРасшифровка = Выборка.Выбрать();
				
				Если ВыборкаРасшифровка.Количество() > 0 Тогда
					ТД.НачатьГруппуСтрок(, Истина);
					
					Область = Макет.ПолучитьОбласть("ШапкаРасшифровки");
					ТД.Вывести(Область);
					
					Пока ВыборкаРасшифровка.Следующий() Цикл
						
						Область = Макет.ПолучитьОбласть("СтрокаРасшифровки");
						ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаРасшифровка);
						
						МассивОбластейДляПроверки = Новый Массив;
						МассивОбластейДляПроверки.Добавить(Область);
			
						Если Не ТД.ПроверитьВывод(МассивОбластейДляПроверки) Тогда
							ТД.ВывестиГоризонтальныйРазделительСтраниц();
							
							ОбластьШапка = Макет.ПолучитьОбласть("ШапкаОсновнойТаблицы");
							ТД.Вывести(ОбластьШапка);
							ОбластьШапка = Макет.ПолучитьОбласть("ШапкаРасшифровки");
							ТД.Вывести(ОбластьШапка);
						КонецЕсли; 
						
						ТД.Вывести(Область);
					КонецЦикла;
					ТД.ЗакончитьГруппуСтрок();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПустойОтчет(Макет, ТД, ПериодОтчета)
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТД.Вывести(Область);
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);
	
	Если ПериодОтчета.ДатаНачала = Дата(1,1,1) И ПериодОтчета.ДатаОкончания = Дата(1,1,1) Тогда
		//Параметры не выводим
	Иначе
		Область = Макет.ПолучитьОбласть("Параметры");
		
		Если ПериодОтчета.ДатаНачала = Дата(1,1,1) Тогда
			Область.Параметры.ПараметрПериод = " с " + Формат(ПериодОтчета.ДатаНачала, "ДФ=dd.MM.yyyy") + " по -";
		ИначеЕсли ПериодОтчета.ДатаОкончания = Дата(1,1,1) Тогда
			Область.Параметры.ПараметрПериод = " с - по " + Формат(ПериодОтчета.ДатаОкончания, "ДФ=dd.MM.yyyy");
		ИначеЕсли НачалоДня(ПериодОтчета.ДатаНачала) = НачалоДня(ПериодОтчета.ДатаОкончания) Тогда
			Область.Параметры.ПараметрПериод = " " + Формат(ПериодОтчета.ДатаОкончания, "ДФ=dd.MM.yyyy");
		Иначе
			Область.Параметры.ПараметрПериод = " с " + Формат(ПериодОтчета.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ПериодОтчета.ДатаОкончания, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ТД.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТД.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ШапкаОсновнойТаблицы");
	ТД.Вывести(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере(ТД, ПериодОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДата = ТекущаяДата();
	
	ПериодОтчета.ДатаНачала = НачалоДня(НачалоДня(ТекущаяДата) - 1);
	ПериодОтчета.ДатаОкончания = НачалоДня(ТекущаяДата) - 1;
	
	ВариантОтчета = "СоЗвонкамиБезГруппировки";
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	ТД = Новый ТабличныйДокумент;
	
КонецПроцедуры
